{
  "Introduction": "<h1>Introduction</h1><p>S-Mapper is a user-friendly application for remapping input events so you can adapt your mouse and keyboard behavior to different applications or workflows. It lets you define mappings that are active only when a target window (by title) is focused, so you can customize per-application controls without changing global behavior.</p><p>This help index explains the core features, common use-cases, tips for reliability, and how to troubleshoot problems.</p><h2>Key Concepts</h2><ul><li><b>Mappings</b> - Map a source trigger (keyboard key or mouse click pattern) to a keyboard action.</li><li><b>Target Window</b> - A case-insensitive substring used to scope the mapping to a particular application window.</li><li><b>Low-level suppression</b> - Optional method to suppress the original keypress and inject a different key at a lower level (may need admin).</li></ul>",

  "Mouse Mappings": "<h1>Mouse to Keyboard Mapping</h1><p>Use this when you want a mouse button (e.g., double-click) to act like a keyboard shortcut inside a particular application.</p><h2>How to set it up</h2><ol><li>Choose the mouse button from the dropdown (left/right/middle/x1/x2).</li><li>Set the number of presses required (e.g., 2 for double-click).</li><li>Pick the target keyboard key and optional modifier(s) to be synthesized.</li><li>Set the target window substring so the mapping only applies when that app is active.</li><li>Click <b>Add Mapping</b> then test in the target app.</li></ol><h2>Real-world Examples</h2><ul><li>Map <b>double-left-click</b> to <b>Ctrl+F</b> inside a text editor to quickly open find.</li><li>Map <b>side button (x1)</b> to <b>Alt+Tab</b> for fast app switching in a particular game window.</li></ul><h2>Tips</h2><ul><li>Keep target window titles specific enough to avoid accidental matches.</li><li>Adjust the click-interval setting if you find your double-clicks aren't reliably detected.</li></ul>",

  "Keyboard Mappings": "<h1>Keyboard to Keyboard Mapping</h1><p>Remap one key (the source) to another key or key combination (the target), scoped to a specific target window.</p><h2>Use-cases</h2><ul><li>Make <b>F12</b> behave like <b>Esc</b> in an older fullscreen app that doesn't handle Esc consistently.</li><li>Map <b>Caps Lock</b> to <b>Ctrl</b> in a terminal window to speed up shortcuts.</li></ul><h2>Best practices</h2><ol><li>Prefer lower-case names when entering keys — the app normalizes keys internally.</li><li>If you need to remap complex hotkeys, include modifier keys in the target (e.g., <code>ctrl + alt + d</code>).</li><li>When using low-level suppression (advanced), keep mappings small and targeted to avoid interfering with OS/global hotkeys.</li></ol>",

  "Mappings Tab": "<h1>Mappings Tab & Editor</h1><p>The Mappings tab is where you create mappings that remap source triggers (keyboard keys or mouse button sequences) to target keyboard actions. Mappings are applied only when the active window contains the target substring you set.</p><h2>Creating a mapping</h2><ol><li>Choose a source trigger: select a keyboard key or a mouse button and number of presses.</li><li>Pick the target keyboard key (and optional modifiers).</li><li>Provide a partial target window title so the mapping only fires when that app is active.</li><li>Click <b>Add Mapping</b> to add it to the list.</li></ol><h2>Editing and managing</h2><p>Select an existing mapping and use <b>Edit Selected</b> to load it for editing — the Add button becomes <b>Save Changes</b>. You can Cancel to abort edits, or Remove Selected to delete mappings. Right-click a mapping for quick Edit/Delete actions.</p><h2>Click interval</h2><p>When using mouse mappings, the <i>Double-click window (sec)</i> controls how quickly subsequent clicks must occur to count for multi-press mappings; increase it if double-clicks are being missed.</p>",

  "Macros": "<h1>Macros (Record & Replay)</h1><p>Macros let you record and replay short sequences of actions (text, key presses, small pauses). Use the editor on the right side of the <b>Macros</b> tab to create, record, edit, and run macros.</p><h2>Creating a macro</h2><ol><li>Give the macro a <b>Name</b>.</li><li>Either click <b>Record</b> and perform the actions (the recorder captures most keys and optional mouse clicks), or enter actions manually in the <i>Actions</i> textbox using lines such as <code>text:Hello</code>, <code>key:enter</code>, or <code>sleep:0.2</code>.</li><li>Optionally choose a <b>Trigger</b> (keyboard key or mouse button + presses) and a target window substring; this creates a mapping that will fire the macro automatically when the trigger occurs in that window.</li><li>Click <b>Add Macro</b> to save it.</li></ol><h2>Editing macros</h2><p>Select a saved macro and click <b>Edit Macro</b> to load it into the editor; the <b>Add Macro</b> button toggles to <b>Save Changes</b> while editing, and you can Cancel to discard modifications. Edited macros replace the existing entry in place so mappings that reference the macro ID continue to work.</p><h2>Persistence</h2><p>Macros are persisted into a separate <code>macros.ini</code> file in the same location used for <code>mappings.ini</code> (%LOCALAPPDATA%/S-Mapper on Windows) so your macros and triggers survive restarts.</p><h2>Safety & abort behavior</h2><p>Macros run in a background thread and won't re-trigger mappings while executing. If you provide a trigger for a macro it becomes available like any other mapping. For safety, any real user input (key or mouse) detected while a macro is executing will abort the currently running macro so you can regain control immediately.</p><h2>Tip: Avoid macros aborting themselves</h2><p>S-Mapper ignores its own recently-injected events, so macros generally won't abort themselves. If you find a macro is prematurely stopping, try increasing the small synthetic-input grace window in advanced settings or change the macro timing to avoid overlap with the host application's input handling.</p>",

  "Ping Monitor": "<h1>Clipboard IP Ping Monitor</h1><p>The IP Ping Monitor watches your clipboard and, when you copy an IPv4 address while the configured target window is active, it executes a ping and displays results. This is useful for quick network checks while working in applications such as game clients, remote tools, or admin consoles.</p><h2>How to use</h2><ol><li>Enter a substring of the window title you want to monitor in the \"Target Window Contains\" field (e.g., <i>\"MyGame\"</i>).</li><li>Click <b>Start Monitoring</b>.</li><li>Copy an IPv4 address to the clipboard while that window is active — the app auto-pings and shows the result in the Ping Log.</li></ol><h2>Why this is useful</h2><ul><li>Quickly check server reachability without leaving your active application.</li><li>Keep a log of past pings in the Ping Log tab, including full command output.</li></ul><h2>Persistence</h2><p>The target window substring you enter is saved in <code>mappings.ini</code> and restored on startup so the monitor will remember your configured target window between runs.</p><h2>Limitations</h2><ul><li>Parsing ping output relies on common Windows output formats — in rare locales or OS variants you may see different phrasing; the app errs on the side of conservatively treating non-empty responses as success.</li><li>For extremely robust checks consider using a native ICMP library or a direct socket probe if you need cross-locale guarantees.</li></ul>",

  "Low-Level Suppression": "<h1>Low-Level Keyboard Suppression</h1><p>This advanced feature installs per-key low-level intercepts that allow S-Mapper to suppress the original keypress and inject a different sequence. It is intended for situations where regular simulated key events are not accepted (some games or protected apps).</p><h2>Important considerations</h2><ul><li>May require running the app as administrator on Windows to install global hooks reliably.</li><li>Low-level hooks can interfere with OS-level hotkeys (e.g., Ctrl+Alt+Del), so use them sparingly and target only the keys you need.</li><li>When enabling, the app will attempt to register hooks and will notify you if the attempt fails.</li></ul><h2>Example</h2><p>If a game doesn't accept programmatic Ctrl+Shift+F, use low-level suppression to intercept a source key and emit the exact sequence while preventing the original key from reaching the app.</p>",

  "App Window & Tray": "<h1>Application Window & System Tray</h1><p>S-Mapper uses a system tray icon when available. When minimized the app will hide to the tray and show a short notification. Clicking the tray icon restores the window.</p><h2>When the tray is unavailable</h2><p>If the environment doesn't provide a tray (AppContainer/MSIX), S-Mapper will not hide on minimize so you don't lose access to the UI.</p>",

  "Settings & Files": "<h1>Settings & Files</h1><p>S-Mapper persists your configuration so mappings and macros remain between runs. Files are stored under the OS-specific local appdata area (Windows: <code>%LOCALAPPDATA%/S-Mapper</code>).</p><ul><li><code>mappings.ini</code> — contains mappings and general settings like the click interval and ping monitor target.</li><li><code>macros.ini</code> — contains saved macros and triggers.</li><li><code>error.log</code> — diagnostic logs created in the same folder when errors occur.</li></ul>",

  "Examples": "<h1>Practical Examples</h1><p>Here are some real mappings people commonly create:</p><ul><li><b>Make a mouse side button send Ctrl+C</b> inside a selected editor window to create a quick copy action there only.</li><li><b>Map a double-right-click to Alt+Enter</b> in a developer tool to toggle a console.</li><li><b>Remap caps-lock to Ctrl in the terminal</b> to make shortcuts more comfortable.</li></ul>",

  "Troubleshooting": "<h1>Troubleshooting & Common Issues</h1><h2>Mappings not working</h2><ul><li>Verify the matching target window string is correct and specific. The match is case-insensitive and substring-based.</li><li>If using low-level suppression, ensure the app has the privileges required on Windows (try running elevated).</li><li>Check the Ping Log / Error Log for any failures or diagnostic messages.</li></ul><h2>Key repeats or loops</h2><p>If you see repeated events, the app tries to protect against synthetic input loops using a short ignore window. If loops happen, ensure your target mapping doesn't re-emit its source or conflict with modifier checks.</p>",

  "Best Practices": "<h1>Best Practices</h1><ul><li>Keep mappings scoped to specific windows — avoid using very short, generic window titles that could match many apps.</li><li>When possible prefer keyboard-to-keyboard mappings for consistency; mouse patterns are great for quick in-app shortcuts.</li><li>Only enable low-level suppression for keys that truly require it — it's more powerful but riskier than the default high-level path.</li><li>Use the Ping Log and error log (in %LOCALAPPDATA%\\S-Mapper\\error.log) to diagnose unexpected behavior.</li></ul>"
}